import { createServer } from "miragejs"

export const server = {
    start: () => createServer,
    log: () => console.log('server is working')
}

createServer({
    routes() {
        this.post("/all", (schema, request) => {
            const { count } = JSON.parse(request.requestBody)
            return all.filter((it, i) => i < count)
        }),
        this.get("/property", () => property),
        this.get("/transport", () => transport),
        this.get("/equipment", () => equipment)
    },
})

const property = [
    { id: 1, name: "Здание специализированное для бытового обслуживания населения", address: 'Гомельская обл., Брагинский р-н, Угловский с/с, д. Рудня Журавлево, 17', requestStart: '2022-06-18T21:51:54.578Z', requestEnd: '2022-07-02T21:51:54.578Z', auctionStart: '2022-06-18T21:51:54.578Z', auctionEnd: '2022-07-02T21:51:54.578Z'},
    { id: 2, name: "Здание специализированное для бытового обслуживания населения", address: 'Гомельская обл., Брагинский р-н, Угловский с/с, д. Рудня Журавлево, 17', requestStart: '2022-06-18T21:51:54.578Z', requestEnd: '2022-07-02T21:51:54.578Z', auctionStart: '2022-06-18T21:51:54.578Z', auctionEnd: '2022-07-02T21:51:54.578Z'},
    { id: 3, name: "Здание специализированное для бытового обслуживания населения", address: 'Гомельская обл., Брагинский р-н, Угловский с/с, д. Рудня Журавлево, 17', requestStart: '2022-06-18T21:51:54.578Z', requestEnd: '2022-07-02T21:51:54.578Z', auctionStart: '2022-06-18T21:51:54.578Z', auctionEnd: '2022-07-02T21:51:54.578Z'},
    { id: 4, name: "Здание специализированное для бытового обслуживания населения", address: 'Гомельская обл., Брагинский р-н, Угловский с/с, д. Рудня Журавлево, 17', requestStart: '2022-06-18T21:51:54.578Z', requestEnd: '2022-07-02T21:51:54.578Z', auctionStart: '2022-06-18T21:51:54.578Z', auctionEnd: '2022-07-02T21:51:54.578Z'},
    { id: 5, name: "Здание специализированное для бытового обслуживания населения", address: 'Гомельская обл., Брагинский р-н, Угловский с/с, д. Рудня Журавлево, 17', requestStart: '2022-06-18T21:51:54.578Z', requestEnd: '2022-07-02T21:51:54.578Z', auctionStart: '2022-06-18T21:51:54.578Z', auctionEnd: '2022-07-02T21:51:54.578Z'},
    { id: 6, name: "Здание специализированное для бытового обслуживания населения", address: 'Гомельская обл., Брагинский р-н, Угловский с/с, д. Рудня Журавлево, 17', requestStart: '2022-06-18T21:51:54.578Z', requestEnd: '2022-07-02T21:51:54.578Z', auctionStart: '2022-06-18T21:51:54.578Z', auctionEnd: '2022-07-02T21:51:54.578Z'},
    { id: 7, name: "Здание специализированное для бытового обслуживания населения", address: 'Гомельская обл., Брагинский р-н, Угловский с/с, д. Рудня Журавлево, 17', requestStart: '2022-06-18T21:51:54.578Z', requestEnd: '2022-07-02T21:51:54.578Z', auctionStart: '2022-06-18T21:51:54.578Z', auctionEnd: '2022-07-02T21:51:54.578Z'},
    { id: 8, name: "Здание специализированное для бытового обслуживания населения", address: 'Гомельская обл., Брагинский р-н, Угловский с/с, д. Рудня Журавлево, 17', requestStart: '2022-06-18T21:51:54.578Z', requestEnd: '2022-07-02T21:51:54.578Z', auctionStart: '2022-06-18T21:51:54.578Z', auctionEnd: '2022-07-02T21:51:54.578Z'},

]

const transport = [
    { id: 1, name: "Фура" },
    { id: 2, name: "Прицеп" },
    { id: 3, name: "Мотоцикл" },
]

const equipment = [
    { id: 1, name: "Гайковерт" },
    { id: 2, name: "Пневмоинструмент" },
    { id: 3, name: "Пилы дисковые" },
]

const all = [...property, ...transport, ...equipment]